frank26080115/robots/Roach/libraries/nRF52RcRadio/nRF52RcRadio.cpp
#include "nRF52RcRadio.h"

#include "nrf_radio.h"
#include "nrf_ppi.h"
#include "nrf_egu.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

typedef struct
{
    uint8_t s0;
    uint8_t len;
    uint8_t s1;

    // automatic encryption covers the following
    // checksum coverage is from here as well
    // I think there's room here for 254 bytes

    // metadata
    #ifdef NRFRR_FINGER_QUOTES_RANDOMNESS
    uint32_t rand;
    #endif
    uint32_t uid;
    uint32_t seq_num;
    uint32_t session;
    uint8_t  chan_hint; // what channel index was actually used to TX
    uint8_t  flags;     // contains things like a reply-request
    #ifdef NRFRR_ADAPTIVE_INTERVAL
    uint8_t  interval;  // transmission interval that the receiver can adapt the timeout
    #endif

    // payload
    uint8_t payload[NRFRR_PAYLOAD_SIZE];

    #ifdef NRFRR_USE_MANUAL_CRC
    uint32_t checksum; // checksum starting from end of the header, excluding self
                       // not to be confused with automatic CRC
    #endif
}
__attribute__ ((packed))
nrfrr_pkt_t;

// nRF52's frequency register doesn't care about 802.15.4 channels, it's actually just raw frequency
// so we only make the "good" ones available
static const uint16_t freq_lookup[] {
#ifdef NRFRR_USE_FREQ_LOWER
    0x100 +  0, // 2360 MHz
    0x100 +  5, // 2365 MHz
    0x100 + 10, // 2370 MHz
    0x100 + 15, // 2375 MHz
    0x100 + 20, // 2380 MHz
    0x100 + 25, // 2385 MHz
    0x100 + 30, // 2390 MHz
    0x100 + 35, // 2395 MHz
#endif
    0x000 + 25, // 2425 MHz
#ifdef NRFRR_USE_FREQ_EUROPEAN
    0x000 + 30, // 2430 MHz
#endif
#ifdef NRFRR_USE_FREQ_NORTHAMERICAN
    0x000 + 50, // 2450 MHz
#endif
#ifdef NRFRR_USE_FREQ_EUROPEAN
    0x000 + 55, // 2455 MHz
    0x000 + 60, // 2460 MHz
#endif
#ifdef NRFRR_USE_FREQ_NORTHAMERICAN
    0x000 + 75, // 2475 MHz
    0x000 + 80, // 2480 MHz
#endif
#ifdef NRFRR_USE_FREQ_UPPER
    // note: wifi chan 13 is 2472 MHz, ending at 2483 MHz
    0x000 + 90,  // 2490 MHz
    0x000 + 95,  // 2495 MHz
    0x000 + 100, // 2500 MHz
#endif
};

static uint8_t tx_buffer[NRFRR_PAYLOAD_SIZE];          // application buffer
static uint8_t rx_buffer[NRFRR_PAYLOAD_SIZE];          // application buffer
static uint8_t frame_buffer[sizeof(nrfrr_pkt_t) + 32]; // the buffer that's used by underlying hardware
static bool    rx_flag;                                // indicator of new packet received

static char    txt_rx_buffer[NRFRR_PAYLOAD_SIZE]; // application text buffer
static char    txt_tx_buffer[NRFRR_PAYLOAD_SIZE]; // application text buffer
static bool    txt_flag;                          // indicator of text packet received

static uint32_t invalid_sessions[NRFRR_REM_USED_SESSIONS];

static bool hw_inited = false; // only init once

static nRF52RcRadio* instance; // only one instance allowed for the callback

extern uint32_t nrfrr_getCheckSum(uint32_t salt, uint8_t* data, uint8_t len);
extern uint32_t nrfrr_rand(void);

nRF52RcRadio::nRF52RcRadio(bool is_tx)
{
    _is_tx = is_tx;
    memset(invalid_sessions, 0, sizeof(uint32_t) * NRFRR_REM_USED_SESSIONS);
    var_reset();
}

void nRF52RcRadio::var_reset(void)
{
    _connected = false;
    _tx_interval = NRFRR_TX_INTERV_DEF;
    _session_id = 0;
    _seq_num = 0;
    _seq_num_prev = 0;
    _statemachine = 0;
    _statemachine_next = 0;
    _stat_tmr = 0;
    _stat_tx_cnt = 0;
    _stat_rx_cnt = 0;
    _stat_txt_cnt = 0;
    _stat_drate = 0;
    _stat_rx_lost = 0;
    _stat_loss_rate = 0;
    #ifdef NRFRR_DEBUG_RX_ERRSTATS
    memset(_stat_rx_errs, 0, 4*12);
    #endif
    _stat_rx_total = 0;
    _stat_rx_good = 0;
    _last_rx_time = 0;
    _last_tx_time = 0;
    _last_hop_time = 0;
    _tx_replyreq_tmr = 0;
    _reply_request_rate = 1000;
    _reply_request_latch = false;
    _cur_chan = 0;
    _last_chan = -1;
    _text_send_timer = 0;
    _stat_rx_spent_time = 0;
    rx_flag = false;
    txt_flag = false;
}

void nRF52RcRadio::begin(uint32_t chan_map, uint32_t uid, uint32_t salt, int fem_tx, int fem_rx)
{
    instance = (nRF52RcRadio*)this;

    #ifdef NRFRR_DEBUG_PINS
    pinMode     (NRFRR_DEBUG_PIN_TX, OUTPUT);
    digitalWrite(NRFRR_DEBUG_PIN_TX, _dbgpin_tx = LOW);
    pinMode     (NRFRR_DEBUG_PIN_RX, OUTPUT);
    digitalWrite(NRFRR_DEBUG_PIN_RX, _dbgpin_rx = LOW);
    pinMode     (NRFRR_DEBUG_PIN_CH, OUTPUT);
    digitalWrite(NRFRR_DEBUG_PIN_CH, _dbgpin_ch = LOW);
    #endif

    if (_statemachine != NRFRR_SM_IDLE_WAIT) {
        pause();
    }

    var_reset();
    _uid = uid;
    _salt = salt;

    _fem_tx = fem_tx;
    _fem_rx = fem_rx;
    if (_fem_tx >= 0) {
        pinMode     (_fem_tx, OUTPUT);
        digitalWrite(_fem_tx, LOW);
    }
    if (_fem_rx >= 0) {
        pinMode     (_fem_rx, OUTPUT);
        digitalWrite(_fem_rx, LOW);
    }

    set_chan_map(chan_map);

    if (hw_inited == false) {
        init_hw();
        hw_inited = true;
    }

    // Power on into disabled mode
    NRF_RADIO->SHORTS = (RADIO_SHORTS_READY_START_Enabled << RADIO_SHORTS_READY_START_Pos) | (RADIO_SHORTS_END_DISABLE_Enabled << RADIO_SHORTS_END_DISABLE_Pos);
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_DISABLE = 1;
    while (NRF_RADIO->EVENTS_DISABLED == 0) {
        yield(); // wait for the radio to be disabled
    }
    NRF_RADIO->EVENTS_END = 0;

    set_net_addr(_uid);

    _cur_chan = -1;
    next_chan();

    set_encryption();

    // Configure the automatic CRC
    #ifdef NRFRR_USE_MANUAL_CRC
    NRF_RADIO->CRCCNF = (RADIO_CRCCNF_LEN_One << RADIO_CRCCNF_LEN_Pos);
    NRF_RADIO->CRCINIT = 0xFFFFUL;
    #else
    NRF_RADIO->CRCCNF = (RADIO_CRCCNF_LEN_Two << RADIO_CRCCNF_LEN_Pos);
    NRF_RADIO->CRCINIT = _salt;
    #endif
    NRF_RADIO->CRCPOLY = 0x11021UL;     // CRC poly: x^16+x^12^x^5+1

    if (_is_tx)
    {
        while (_session_id == 0) {
            _session_id = nrfrr_rand();
        }
    }
}

void nRF52RcRadio::init_hw(void)
{
    if ((NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_STATE_Msk) == 0)
    {
        // Enable the High Frequency clock to the system as a whole
        NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
        NRF_CLOCK->TASKS_HFCLKSTART = 1;
        // Wait for the external oscillator to start up
        while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0) {
            yield();
        }
    }

    // Disable and reset the radio
    NRF_RADIO->POWER = RADIO_POWER_POWER_Disabled;
    NRF_RADIO->POWER = RADIO_POWER_POWER_Enabled;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_DISABLE   = 1;
    // Wait until we are in DISABLE state
    while (NRF_RADIO->EVENTS_DISABLED == 0) {
        yield();
    }

    // Physical on-air address is set in PREFIX0 + BASE0 by set_net_addr
    NRF_RADIO->TXADDRESS    = 0x00;	// Use logical address 0 (PREFIX0 + BASE0)
    NRF_RADIO->RXADDRESSES  = 0x01;	// Enable reception on logical address 0 (PREFIX0 + BASE0)

    // These shorts will make the radio transition from Ready to Start to Disable automatically
    // for both TX and RX, which makes for much shorter on-air times
    NRF_RADIO->SHORTS = (RADIO_SHORTS_READY_START_Enabled << RADIO_SHORTS_READY_START_Pos)
                      | (RADIO_SHORTS_END_DISABLE_Enabled << RADIO_SHORTS_END_DISABLE_Pos)
                      ;

    NRF_RADIO->PCNF0 =   (8 << RADIO_PCNF0_LFLEN_Pos)  // Payload size length in bits
                       | (1 << RADIO_PCNF0_S0LEN_Pos)  // S0 is 1 octet
                       | (8 << RADIO_PCNF0_S1LEN_Pos); // S1 is 1 octet

    NRF_RADIO->MODE    = ((
        #if defined(RADIO_MODE_MODE_Nrf_250Kbit) && false
            RADIO_MODE_MODE_Nrf_250Kbit
        #else
            RADIO_MODE_MODE_Nrf_1Mbit
            // TODO: test 2Mbit to see reliability
        #endif
        << RADIO_MODE_MODE_Pos) & RADIO_MODE_MODE_Msk);
    NRF_RADIO->TXPOWER = ((
        #ifdef RADIO_TXPOWER_TXPOWER_Pos8dBm
            RADIO_TXPOWER_TXPOWER_Pos8dBm
        #else
            RADIO_TXPOWER_TXPOWER_Pos4dBm
        #endif
        << RADIO_TXPOWER_TXPOWER_Pos) & RADIO_TXPOWER_TXPOWER_Msk);

    #ifdef NRFRR_USE_INTERRUPTS
    NVIC_SetPriority(RADIO_IRQn, 0);
    NVIC_ClearPendingIRQ(RADIO_IRQn);
    NRF_RADIO->INTENSET = RADIO_INTENSET_END_Msk | RADIO_INTENSET_DISABLED_Msk | RADIO_INTENSET_ADDRESS_Msk | RADIO_INTENSET_RSSIEND_Msk;
    #endif
}

#ifdef NRFRR_USE_INTERRUPTS
void RADIO_IRQHandler_CPP(void)
{
    instance->state_machine_run(millis(), true);
}

#ifdef __cplusplus
extern "C" {
#endif

