frank26080115/robots/Roach/libraries/nRF52RcRadio/nRF52RcRadio.cpp
void RADIO_IRQHandler(void)
{
    RADIO_IRQHandler_CPP();
}

#ifdef __cplusplus
}
#endif
#endif

void nRF52RcRadio::set_net_addr(uint32_t x)
{
    uint8_t* address = (uint8_t*)&x;
    int len = 4;

    // First byte is the prefix, remainder are base
    NRF_RADIO->PREFIX0 = ((address[0] << RADIO_PREFIX0_AP0_Pos) & RADIO_PREFIX0_AP0_Msk);
    uint32_t base;
    memcpy(&base, address+1, len-1);
    NRF_RADIO->BASE0 = base;

    NRF_RADIO->PCNF1 =  (
        (((sizeof(nrfrr_pkt_t))  << RADIO_PCNF1_MAXLEN_Pos)  & RADIO_PCNF1_MAXLEN_Msk)  // maximum length of payload
        | (((0UL)                << RADIO_PCNF1_STATLEN_Pos) & RADIO_PCNF1_STATLEN_Msk)	// expand the payload with 0 bytes
        | (((len-1)              << RADIO_PCNF1_BALEN_Pos)   & RADIO_PCNF1_BALEN_Msk)); // base address length in number of bytes.
}

void nRF52RcRadio::set_encryption(void)
{
    if (_salt != 0 && (_salt & 0x80000000) != 0) // use the last bit in the salt to indicate if encryption is required
    {
        // fake an encryption key with existing information
        // TODO: maybe add a way to load a real key from flash file
        uint32_t tmp32[4];
        tmp32[0] = _uid;
        tmp32[1] = _salt;
        tmp32[2] = nrfrr_getCheckSum(0, (uint8_t*)tmp32, 8);
        tmp32[3] = nrfrr_getCheckSum(0, (uint8_t*)&(tmp32[1]), 8);
        uint8_t* tmp8 = (uint8_t*)tmp32;

        int i, j;
        for (i = 0, j = 0; i < RH_NRF51_AES_CCM_CNF_SIZE; i++)
        {
            _encryption_cnf[i] = tmp8[j];
            j = (j + 1) % (4 * 4);
        }

        // AES configuration data area
        NRF_CCM->CNFPTR  = (uint32_t)_encryption_cnf;

        // Set AES CCM input and putput buffers
        // Make sure the _buf is encrypted and put back into _buf
        NRF_CCM->INPTR  = (uint32_t)frame_buffer;
        NRF_CCM->OUTPTR = (uint32_t)frame_buffer;
        // Also need to set SCRATCHPTR temp buffer os size 16+MAXPACKETSIZE in RAM
        // FIXME: shared buffers if several radios
        NRF_CCM->SCRATCHPTR = (uint32_t)_scratch;

        // SHORT from RADIO READY to AESCCM KSGEN using PPI predefined channel 24
        // Also RADIO ADDRESS to AESCCM CRYPT using PPI predefined channel 25
        NRF_PPI->CHENSET =   (PPI_CHENSET_CH24_Enabled << PPI_CHENSET_CH24_Pos)
                           | (PPI_CHENSET_CH25_Enabled << PPI_CHENSET_CH25_Pos)
            ;

        // SHORT from AESCCM ENDKSGEN to AESCCM CRYPT
        NRF_CCM->SHORTS = (CCM_SHORTS_ENDKSGEN_CRYPT_Enabled << CCM_SHORTS_ENDKSGEN_CRYPT_Pos);

        // Enable the CCM module
        NRF_CCM->ENABLE = (CCM_ENABLE_ENABLE_Enabled << CCM_ENABLE_ENABLE_Pos);

        _encrypting = true;
    }
    else
    {
        // Disable the CCM module
        NRF_CCM->ENABLE = (CCM_ENABLE_ENABLE_Disabled << CCM_ENABLE_ENABLE_Pos);
        _encrypting = false;
    }
}

void nRF52RcRadio::gen_hop_table(void)
{
    // generate hop table, fill table with an entry if the bit of the map bitmask is set
    _hop_table = (uint8_t*)malloc((sizeof(freq_lookup) / 2) + 1);
    int i, j;
    for (i = 0, j = 0; i < (sizeof(freq_lookup) / 2); i++)
    {
        if ((_chan_map & (1 << i)) != 0) {
            _hop_table[j] = i + 1;
            _hop_table[j + 1] = 0;
            j++;
            _hop_tbl_len = j;
        }
    }

    if (_salt != 0)
    {
        uint32_t tmp32[4];
        tmp32[0] = _uid;
        tmp32[1] = _salt;
        tmp32[2] = nrfrr_getCheckSum(0, (uint8_t*)tmp32, 8);
        tmp32[3] = nrfrr_getCheckSum(0, (uint8_t*)&(tmp32[1]), 8);
        uint8_t* tmp8 = (uint8_t*)tmp32;

        // shuffle the table according to our salt
        // this prevents jamming by following a known hop sequence
        for (i = 0; i < _hop_tbl_len; i++)
        {
            j = tmp8[i] % _hop_tbl_len;
            uint8_t t = _hop_table[j];
            _hop_table[j] = _hop_table[i];
            _hop_table[i] = t;
        }
    }
    #ifdef NRFRR_DEBUG_HOPTABLE
    Serial.printf("Hop Table: ");
    for (i = 0; i < _hop_tbl_len; i++) {
        Serial.printf("%d  ", _hop_table[i]);
    }
    #endif
    _cur_chan %= _hop_tbl_len;
}

void nRF52RcRadio::set_chan_map(uint32_t x)
{
    _single_chan_mode = (x & 0x80000000) != 0;
    uint32_t i, m;
    for (i = 0, m = 0; i < (sizeof(freq_lookup) / 2); i++)
    {
        m |= 1 << i;
    }
    _chan_map = x & m;
    _chan_map = _chan_map == 0 ? NRFRR_CHAN_MAP_DEFAULT : _chan_map;
    gen_hop_table();
}

void nRF52RcRadio::set_tx_interval(uint16_t x)
{
    _tx_interval = x > NRFRR_TX_INTERV_MAX ? NRFRR_TX_INTERV_MAX : (x < NRFRR_TX_INTERV_MIN ? NRFRR_TX_INTERV_MIN : x);
}

void nRF52RcRadio::send(uint8_t* data)
{
    memcpy(tx_buffer, data, NRFRR_PAYLOAD_SIZE);
}

void nRF52RcRadio::prep_tx(void)
{
    bool is_text = _text_send_timer > 0;

    nrfrr_pkt_t* ptr = (nrfrr_pkt_t*)frame_buffer;
    gen_header();
    if (is_text) {
        ptr->flags ^= (1 << NRFRR_FLAG_TEXT);
    }

    uint8_t* src_buf = is_text ? (uint8_t*)txt_tx_buffer : (uint8_t*)tx_buffer;

    memcpy(ptr->payload, src_buf, NRFRR_PAYLOAD_SIZE);

    #ifdef NRFRR_USE_MANUAL_CRC
    ptr->chksum = nrfrr_getCheckSum(_salt, &(frame_buffer[NRFRR_CHECKSUM_START_IDX]), sizeof(nrfrr_pkt_t) - 4 - NRFRR_CHECKSUM_START_IDX);
    #endif

    #ifdef NRFRR_DEBUG_TX
    Serial.printf("TX[t %u][c %u][s %u]: ", millis(), hop_table[_cur_chan], sizeof(nrfrr_pkt_t));
    int i;
    for (i = 0; i < sizeof(nrfrr_pkt_t); i++)
    {
        Serial.printf("0x%02X ", frame_buffer[i]);
    }
    Serial.printf("\r\n");
    #endif

    _stat_tx_cnt++;
    _last_tx_time = millis();

    #ifdef NRFRR_DEBUG_HOP
    Serial.printf("TX %u %u\r\n", _last_tx_time, _seq_num);
    #endif

    if (is_text)
    {
        // text needs to be repeatedly sent for redundancy but we also want to avoid duplicates
        // so we do not increment sequence number, unless we have finished sending the text
        _text_send_timer--;
        if (_text_send_timer <= 0) {
            _seq_num++;
            _text_send_timer = 0;
        }
    }
    else
    {
        // increment sequence number since it's not text, we want to avoid duplicates
        _seq_num++;
    }

    if (_seq_num == 0) {
        // roll-over occured, start new session
        _session_id = nrfrr_rand();
        _seq_num++;
    }
}

void nRF52RcRadio::next_chan(void)
{
    _cur_chan++;
    _cur_chan %= _hop_tbl_len;
    uint8_t nchan = _hop_table[_cur_chan] - 1;
    //if (nchan != _last_chan) // prevent wasting time changing to the same channel
    {
        uint16_t freq = freq_lookup[nchan];

