frank26080115/robots/Roach/libraries/nRF52RcRadio/nRF52RcRadio.cpp
        #ifdef NRFRR_DEBUG_HOP
        Serial.printf("HOP %u %u %u %u\r\n", millis(), _cur_chan, nchan, ((freq & 0x100) != 0) ? (2360 + (freq & 0xFF)) : (2400 + freq));
        #endif

        NRF_RADIO->FREQUENCY = freq;

        #ifdef NRFRR_DEBUG_PINS
        digitalWrite(NRFRR_DEBUG_PIN_CH, _dbgpin_ch = (_dbgpin_ch == LOW ? HIGH : LOW));
        #endif

        _last_chan = nchan;
    }

    _last_hop_time = millis();
}

void nRF52RcRadio::gen_header(void)
{
    uint32_t now = millis();

    nrfrr_pkt_t* ptr = (nrfrr_pkt_t*)frame_buffer;

    ptr->s0 = 0;
    ptr->s1 = 0;
    ptr->len = sizeof(nrfrr_pkt_t);

    uint32_t r =
        #ifdef NRFRR_FINGER_QUOTES_RANDOMNESS
            nrfrr_rand()
            // TODO: check speed of RNG
        #else
            0
        #endif
        ;
    // the random number is used to make the MAC addresses random each time just in case it's a match for a real device
    // we don't want that device to actually be confused
    // it also makes the packet look like it's encrypted
    // it is not...
    // if the attacker reads this source code, the random number is pretty much useless
    #ifdef NRFRR_FINGER_QUOTES_RANDOMNESS
    ptr->rand       = r;
    #endif
    ptr->uid        = _uid         ^ r;
    ptr->session    = _session_id  ^ r;
    ptr->chan_hint  = _cur_chan    ^ r;
    ptr->seq_num    = _seq_num     ^ r;
    #ifdef NRFRR_ADAPTIVE_INTERVAL
    ptr->interval   = _tx_interval ^ r;
    #endif
    ptr->flags      = 0;

    #ifdef NRFRR_BIDIRECTIONAL
    if (_is_tx == false)
    {
        ptr->flags |= (1 << NRFRR_FLAG_REPLY);
    }
    else
    {
        if ((now - _tx_replyreq_tmr) >= _reply_request_rate && _reply_request_rate != 0) {
            _reply_request_latch = true;
            _tx_replyreq_tmr = now;
        }
        if (_reply_request_latch) {
            ptr->flags |= (1 << NRFRR_FLAG_REPLYREQUEST);
        }
    }
    #endif

    ptr->flags ^= r;
}

bool nRF52RcRadio::state_machine_run(uint32_t now, bool is_isr)
{
    bool ret = false; // return true for "run again"

    #ifdef NRFRR_USE_INTERRUPTS
    if (is_isr == false) {
        __disable_irq();
    }
    #endif

    #ifdef NRFRR_USE_INTERRUPTS
    if (is_isr)
    {
        if (NRF_RADIO->EVENTS_END)
        {
            if (_statemachine >= NRFRR_SM_TX_START && _statemachine <= NRFRR_SM_TX_WAIT)
            {
                NRF_RADIO->EVENTS_END = 0;
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->TASKS_DISABLE = 1;
                if (_is_tx)
                {
                    _statemachine = NRFRR_SM_RX_START;
                }
                else
                {
                    _statemachine = NRFRR_SM_HOP_START;
                    _statemachine_next = NRFRR_SM_RX_START;
                }
                _sm_time = now;
                _sm_evt_time = now;
                ret = true;
            }
            else if (_statemachine >= NRFRR_SM_RX_START && _statemachine <= NRFRR_SM_RX_END_WAIT2)
            {
                NRF_RADIO->EVENTS_END = 0;
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->TASKS_DISABLE = 1;
                NRF_RADIO->TASKS_RSSISTOP = 1;
                if (_encrypting) {
                    _statemachine = NRFRR_SM_RX_END_WAIT;
                }
                else {
                    _statemachine = NRFRR_SM_RX_END_WAIT;
                }
                _rx_time_cache = now;
                _sm_time = now;
                _sm_evt_time = now;
                ret = true;
            }
        }
        else if (NRF_RADIO->EVENTS_DISABLED)
        {
            if (_statemachine == NRFRR_SM_RX_END_WAIT)
            {
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->EVENTS_END = 0;
                if (_encrypting) {
                    _statemachine = NRFRR_SM_RX_END_WAIT2;
                }
                else
                {
                    _statemachine = NRFRR_SM_RX_END; // this will cause validate_rx() to run in this ISR
                    ret = true;
                }
                _sm_time = now;
            }
        }
        else if (NRF_RADIO->EVENTS_ADDRESS)
        {
            if (_statemachine >= NRFRR_SM_RX_START && _statemachine <= NRFRR_SM_RX_END_WAIT2)
            {
                NRF_RADIO->EVENTS_ADDRESS = 0;
                NRF_RADIO->TASKS_RSSISTART = 1;
            }
        }
        else if (NRF_RADIO->EVENTS_RSSIEND)
        {
            NRF_RADIO->EVENTS_RSSIEND = 0;
            NRF_RADIO->TASKS_RSSISTOP = 1;
        }
    }
    #endif

    switch(_statemachine)
    {
        case NRFRR_SM_IDLE_WAIT:
            if (NRF_RADIO->STATE == NRF_RADIO_STATE_DISABLED)
            {
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->EVENTS_END = 0;
                _statemachine = NRFRR_SM_IDLE;
                _sm_time = now;
                _sm_evt_time = now;
                ret = true;
            }
            break;
        case NRFRR_SM_IDLE:
            if (_is_tx)
            {
                if ((now - _last_tx_time) >= _tx_interval)
                {
                    prep_tx();
                    _statemachine = NRFRR_SM_TX_START;
                    _sm_time = now;
                }
            }
            else
            {
                //prep_tx();
                //_statemachine = NRFRR_SM_TX_START;
                _statemachine = NRFRR_SM_RX_START;
                _sm_time = now;
            }
            ret = true;
            break;
        case NRFRR_SM_TX_START_DELAY:
            if ((now - _sm_evt_time) >= 2)
            {
                _statemachine = NRFRR_SM_TX_START;
                _sm_time = now;
                ret = true;
            }
            break;
        case NRFRR_SM_TX_START:
            // do this check for connectivity here, since it's not a frequent calculation
            if ((now - _last_rx_time) >= (_is_tx ? 3000 : 1000)) {
                _connected = false;
            }

            if (_fem_tx >= 0) {
                digitalWrite(_fem_tx, HIGH);
            }
            if (_fem_rx >= 0) {
                digitalWrite(_fem_rx, LOW);
            }

            // Maybe set the AES CCA module for the correct encryption mode
            if (_encrypting) {
                NRF_CCM->MODE = (CCM_MODE_MODE_Encryption << CCM_MODE_MODE_Pos); // Encrypt
            }
            // Radio will transition automatically to Disable state at the end of transmission
            NRF_RADIO->PACKETPTR = (uint32_t)frame_buffer;
            NRF_RADIO->EVENTS_READY = 0;
            NRF_RADIO->EVENTS_END = 0; // So we can detect end of transmission
            NRF_RADIO->TASKS_TXEN = 1;

            #ifdef NRFRR_DEBUG_PINS
            digitalWrite(NRFRR_DEBUG_PIN_TX, HIGH);
            #endif

