frank26080115/robots/Roach/libraries/nRF52RcRadio/nRF52RcRadio.cpp
            _statemachine = NRFRR_SM_TX_WAIT;
            _sm_time = now;
            break;
        case NRFRR_SM_TX_WAIT:
            if (NRF_RADIO->EVENTS_END || NRF_RADIO->EVENTS_DISABLED)
            {
                NRF_RADIO->EVENTS_END = 0;
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->TASKS_DISABLE = 1;

                #ifdef NRFRR_DEBUG_PINS
                digitalWrite(NRFRR_DEBUG_PIN_TX, LOW);
                #endif
                if (_fem_tx >= 0) {
                    digitalWrite(_fem_tx, LOW);
                }

                if (_is_tx)
                {
                    #ifdef NRFRR_BIDIRECTIONAL
                    _statemachine = NRFRR_SM_RX_START;
                    #else
                    _statemachine = NRFRR_SM_HOP_START;
                    _statemachine_next = NRFRR_SM_IDLE_WAIT;
                    #endif
                }
                else
                {
                    _statemachine = NRFRR_SM_HOP_START;
                    _statemachine_next = NRFRR_SM_RX_START;
                }
                _sm_time = now;
                _sm_evt_time = now;
                ret = true;
            }
            break;
        case NRFRR_SM_RX_START:
            if (NRF_RADIO->STATE == NRF_RADIO_STATE_DISABLED)
            {
                // do this check for connectivity here, since it's not a frequent calculation
                if ((now - _last_rx_time) >= (_is_tx ? 3000 : 1000)) {
                    _connected = false;
                }

                if (_fem_tx >= 0) {
                    digitalWrite(_fem_tx, LOW);
                }
                if (_fem_rx >= 0) {
                    digitalWrite(_fem_rx, HIGH);
                }

                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->EVENTS_END = 0;
                // Maybe set the AES CCA module for the correct encryption mode
                if (_encrypting) {
                    NRF_CCM->MODE = (CCM_MODE_MODE_Decryption << CCM_MODE_MODE_Pos); // Decrypt
                }
                //NRF_CCM->MICSTATUS = 0;
                // Radio will transition automatically to Disable state when a message is received
                NRF_RADIO->PACKETPTR = (uint32_t)frame_buffer;
                NRF_RADIO->EVENTS_READY = 0;
                NRF_RADIO->TASKS_RXEN = 1;
                NRF_RADIO->EVENTS_END = 0; // So we can detect end of reception
                _statemachine = NRFRR_SM_RX;
                _sm_time = now;
                _sm_evt_time = now;
            }
            break;
        case NRFRR_SM_RX:
            if (NRF_RADIO->EVENTS_ADDRESS)
            {
                NRF_RADIO->EVENTS_ADDRESS = 0;
                NRF_RADIO->TASKS_RSSISTART = 1;
            }
            if (NRF_RADIO->EVENTS_RSSIEND)
            {
                NRF_RADIO->EVENTS_RSSIEND = 0;
                NRF_RADIO->TASKS_RSSISTOP = 1;
            }

            if (NRF_RADIO->EVENTS_END)
            {
                NRF_RADIO->EVENTS_END = 0;
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->TASKS_DISABLE = 1;
                NRF_RADIO->TASKS_RSSISTOP = 1;
                _statemachine = NRFRR_SM_RX_END_WAIT;
                _rx_time_cache = now;
                _sm_time = now;
                _sm_evt_time = now;
                ret = true;
                break;
            }
            #ifdef NRFRR_BIDIRECTIONAL
            if (_is_tx)
            {
                if ((now - _last_tx_time) >= (_tx_interval - 2)) // timeout waiting for a reply
                {
                    NRF_RADIO->EVENTS_DISABLED = 0;
                    NRF_RADIO->TASKS_DISABLE = 1;
                    _statemachine = NRFRR_SM_HOP_START;
                    _statemachine_next = NRFRR_SM_IDLE_WAIT;
                    _sm_time = now;
                    break;
                }
            }
            else
            // note: without bidirectional support, a transmitter is never in the RX state
            #endif
            {
                if (_rx_miss_cnt == 0)
                {
                    // when we lose just one packet, assume the same hopping schedule, but turn on the receiver just a tad earlier
                    if ((now - _last_rx_time) >= (_tx_interval + (_tx_interval / 2)))
                    {
                        _rx_miss_cnt++;
                        _statemachine = NRFRR_SM_HOP_START;
                        _statemachine_next = NRFRR_SM_RX_START;
                        _sm_time = now;
                        break;
                    }
                }
                else
                {
                    uint32_t timeout = ((now - _last_rx_time) <= 1000) ? _tx_interval : (_tx_interval * 3);

                    // when we lose just one packet, probably just follow the same hop schedule for a while
                    // but after a while, the transmitter might've been rebooted
                    // so it's better to slow down the hopping, so the transmitter can get back in sync
                    // (not hopping at all is another option but what if that channel is just bad?)

                    if ((now - _last_hop_time) >= timeout)
                    {
                        _rx_miss_cnt++;
                        _statemachine = NRFRR_SM_HOP_START;
                        _statemachine_next = NRFRR_SM_RX_START;
                        _sm_time = now;
                        break;
                    }
                }
            }
            break;
        case NRFRR_SM_RX_END_WAIT:
            if (NRF_RADIO->STATE == NRF_RADIO_STATE_DISABLED)
            {
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->EVENTS_END = 0;
                if (_encrypting) {
                    _statemachine = NRFRR_SM_RX_END_WAIT2;
                }
                else
                {
                    _statemachine = NRFRR_SM_RX_END;
                    ret = true;
                }
                _sm_time = now;
            }
            break;
        case NRFRR_SM_RX_END_WAIT2:
            // this wait state is for the decryption to finish
            if ((now - _sm_evt_time) > 2)
            {
                _statemachine = NRFRR_SM_RX_END;
                _sm_time = now;
                ret = true;
            }
            break;
        case NRFRR_SM_RX_END:
            if (validate_rx())
            {
                _connected = true;
                if (_is_tx)
                {
                    if (_single_chan_mode == false) {
                        next_chan();
                    }
                    _statemachine = NRFRR_SM_CHAN_WAIT;
                    _statemachine_next = NRFRR_SM_IDLE;
                    _sm_time = now;
                }
                else
                {
                    #ifdef NRFRR_BIDIRECTIONAL
                    if (_reply_requested)
                    {
                        prep_tx();
                        _statemachine = NRFRR_SM_TX_START_DELAY;
                    }
                    else
                    #endif
                    {
                        if (_single_chan_mode == false) {
                            next_chan();
                        }
                        _statemachine = NRFRR_SM_CHAN_WAIT;
                        _statemachine_next = NRFRR_SM_RX_START;
                    }
                    _sm_time = now;
                }
            }
            else
            {
                _statemachine = NRFRR_SM_RX_START; // this will go to IDLE and TX if not enough time left
                _sm_time = now;
                ret = true;
            }
            break;
        case NRFRR_SM_HOP_START:
            if (NRF_RADIO->STATE != NRF_RADIO_STATE_DISABLED)
            {
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->TASKS_DISABLE = 1;
            }
            _statemachine = NRFRR_SM_HOP_WAIT;
            _sm_time = now;
            ret = true;
            break;
        case NRFRR_SM_HOP_WAIT:
            if (NRF_RADIO->STATE == NRF_RADIO_STATE_DISABLED)
            {
                NRF_RADIO->EVENTS_END = 0;
                if (_single_chan_mode == false) {
                    next_chan();
                }
                _statemachine = NRFRR_SM_CHAN_WAIT;
                _sm_time = now;
                _sm_evt_time = now;
            }
            break;
        case NRFRR_SM_CHAN_WAIT:
            if (
                (now - _sm_time) >= 2
                || (_is_tx && (now - _last_tx_time) >= _tx_interval)
                )
            {
                _statemachine = _statemachine_next;
                _sm_time = now;
                ret = true;
            }
            break;
        case NRFRR_SM_HALT_START:
            if (NRF_RADIO->STATE != NRF_RADIO_STATE_DISABLED)
            {
                NRF_RADIO->EVENTS_DISABLED = 0;
                NRF_RADIO->TASKS_DISABLE = 1;
            }
            _statemachine = NRFRR_SM_HALT_WAIT;
            _sm_time = now;
            break;
        case NRFRR_SM_HALT_WAIT:
            if (NRF_RADIO->STATE == NRF_RADIO_STATE_DISABLED)
            {
                _statemachine = NRFRR_SM_HALTED;
                _sm_time = now;
            }
            break;
        case NRFRR_SM_HALTED:
            break;
        case NRFRR_SM_CONT_TX:
            {
                if (NRF_RADIO->STATE != RADIO_STATE_STATE_Tx && NRF_RADIO->STATE != RADIO_STATE_STATE_TxRu && NRF_RADIO->STATE != RADIO_STATE_STATE_TxIdle)
                {
                    NRF_RADIO->TASKS_TXEN = 1;
                }
            }
            break;
    }

    #ifdef NRFRR_USE_INTERRUPTS
    if (is_isr == false) {
        __enable_irq();
    }
    #endif

    return ret;
}

