frank26080115/robots/Roach/libraries/nRF52RcRadio/nRF52RcRadio.cpp
bool nRF52RcRadio::is_busy(void)
{
    if (_statemachine == NRFRR_SM_TX_WAIT || _statemachine == NRFRR_SM_CONT_TX || _statemachine == NRFRR_SM_HALTED) {
        return true;
    }
    if (_statemachine == NRFRR_SM_RX) {
        if ((millis() - _last_tx_time) < (_tx_interval - 4)) {
            return true;
        }
    }
    return false;
}

void nRF52RcRadio::task(void)
{
    uint32_t now;

    while (state_machine_run(now = millis(), false)) {
        yield();
    }

    if ((now - _stat_tmr) >= 1000)
    {
        _stat_drate = _is_tx ? _stat_tx_cnt : _stat_rx_cnt;
        _stat_loss_rate = _stat_rx_lost;
        _stat_tx_cnt = 0;
        _stat_rx_cnt = 0;
        _stat_rx_lost = 0;
        _stat_tmr = now;

        // every second, if in single channel RX mode, assess if the data rate is poor, and switch channel if it is
        if (_is_tx == false && _single_chan_mode)
        {
            if (_stat_drate < ((1000 / 20) - 5)) {
                next_chan();
            }
        }
    }
}

bool nRF52RcRadio::validate_rx(void)
{
    uint32_t now = millis();

    _stat_rx_total++;

    uint8_t* u8_ptr = (uint8_t*)frame_buffer;
    nrfrr_pkt_t* parsed = (nrfrr_pkt_t*)u8_ptr;

    #ifdef NRFRR_DEBUG_RX
    Serial.printf("RX[t %u]: ", millis());
    int i;
    for (i = 0; i < parsed->len; i++)
    {
        Serial.printf("0x%02X ", u8_ptr[i]);
    }
    Serial.printf("\r\n");
    #endif

    if (parsed->len < sizeof(nrfrr_pkt_t) - 4 || parsed->len > sizeof(nrfrr_pkt_t) + 4) {
        #ifdef NRFRR_DEBUG_RX_ERRSTATS
        _stat_rx_errs[0]++;
        #endif
        return false;
    }

    uint32_t r = 
        #ifdef NRFRR_FINGER_QUOTES_RANDOMNESS
            parsed->rand // extract the meaningless random number to use to recover other data fields
        #else
            0
        #endif
        ;
    uint32_t rx_uid   = parsed->uid     ^ r;
    uint32_t rx_sess  = parsed->session ^ r;
    uint8_t  rx_flags = parsed->flags   ^ r;
    uint32_t rx_seq   = parsed->seq_num ^ r;

    if (rx_uid != (_uid & 0x00FFFFFF)) { // UID must match
        #ifdef NRFRR_DEBUG_RX_ERRSTATS
        _stat_rx_errs[2]++;
        #endif
        return false;
    }
    if (rx_sess == 0) { // invalid session ID
        #ifdef NRFRR_DEBUG_RX_ERRSTATS
        _stat_rx_errs[3]++;
        #endif
        return false;
    }

    #ifdef NRFRR_USE_MANUAL_CRC
    // verify checksum of payload against claimed checksum
    uint32_t chksum = nrfrr_getCheckSum(_salt, &(u8_ptr[NRFRR_CHECKSUM_START_IDX]), sizeof(nrfrr_pkt_t) - 4 - NRFRR_CHECKSUM_START_IDX);
    if (parsed->chksum != chksum)
    #else
    if (!NRF_RADIO->CRCSTATUS)
    #endif
    {
        #ifdef NRFRR_DEBUG_RX_ERRSTATS
        _stat_rx_errs[4]++;
        #endif
        return false;
    }
    // checksum needs to be valid for the next few security features to work and not be overwhelmed

    if (_is_tx == false) // only receiver requires additional security
    {
        if (_session_id == 0) // first packet ever received
        {
            // start the new session
            _session_id = rx_sess;
            _seq_num_prev = rx_seq;
        }
        else if (_session_id == rx_sess)
        {
            if (rx_seq <= _seq_num_prev)
            {
                // ignore duplicate or replay-attack
                // still do a channel hop if it's a text
                if ((rx_flags & (1 << NRFRR_FLAG_TEXT)) != 0) {
                    _cur_chan = parsed->chan_hint ^ r; // sync with channel hop
                    if (_single_chan_mode == false) {
                        next_chan();
                    }
                    _last_rx_time = now;
                }
                #ifdef NRFRR_DEBUG_RX_ERRSTATS
                _stat_rx_errs[5]++;
                #endif
                return false;
            }

            // calculate how many packets were lost
            uint32_t diff = rx_seq - _seq_num_prev;
            diff -= 1;
            diff = diff > 0xFFFF ? 0xFFFF : diff;
            _stat_rx_lost += diff;

            _seq_num_prev = rx_seq;
        }
        else if (_session_id != rx_sess)
        {
            int i;
            // check if session ID is still valid
            for (i = 0; i < NRFRR_REM_USED_SESSIONS; i++)
            {
                uint32_t j = invalid_sessions[i];
                if (j == rx_sess) { // is invalid
                    #ifdef NRFRR_DEBUG_RX_ERRSTATS
                    _stat_rx_errs[6]++;
                    #endif
                    return false;
                }
                else if (j == 0) {
                    break;
                }
            }
            // store old session as invalid
            if (invalid_sessions[NRFRR_REM_USED_SESSIONS - 1] == 0) // enough space
            {
                // store in next empty slot
                for (i = 0; i < NRFRR_REM_USED_SESSIONS; i++)
                {
                    uint32_t j = invalid_sessions[i];
                    if (j == 0) {
                        invalid_sessions[i] = _session_id;
                    }
                }
            }
            else
            {
                // store in any slot
                invalid_sessions[rand() % NRFRR_REM_USED_SESSIONS] = _session_id;
            }
            // start new session
            _session_id = rx_sess;
            _seq_num_prev = rx_seq;
        }

        #ifdef NRFRR_ADAPTIVE_INTERVAL
        _tx_interval = parsed->interval ^ r;
        #endif

        #ifdef NRFRR_BIDIRECTIONAL
        if ((rx_flags & (1 << NRFRR_FLAG_REPLYREQUEST)) != 0 || _text_send_timer > 0) {
            _reply_requested = true;
        }
        else
        {
            _reply_requested = false;
        }
        #endif
    }
    #ifdef NRFRR_BIDIRECTIONAL
    else // _is_tx == true
    {
        // a reply isn't critical, but make sure the session ID is correct
        if (_session_id != rx_sess) {
            #ifdef NRFRR_DEBUG_RX_ERRSTATS
            _stat_rx_errs[7]++;
            #endif
            return false;
        }

        if (rx_seq <= _seq_num_prev)
        {
            // ignore duplicate or replay-attack
            #ifdef NRFRR_DEBUG_RX_ERRSTATS
            _stat_rx_errs[8]++;
            #endif
            return false;
        }
        _seq_num_prev = rx_seq;
    }
    #endif

    // all checks pass

    #ifdef NRFRR_DEBUG_PINS
    digitalWrite(NRFRR_DEBUG_PIN_RX, _dbgpin_rx = (_dbgpin_rx == LOW ? HIGH : LOW));
    #endif

    uint8_t* dst_buf = ((rx_flags & (1 << NRFRR_FLAG_TEXT)) != 0) ? (uint8_t*)txt_rx_buffer : (uint8_t*)rx_buffer;

    memcpy(dst_buf, (void*)parsed->payload, NRFRR_PAYLOAD_SIZE);

