frank26080115/robots/Roach/libraries/nRF52RcRadio/nRF52RcRadio.cpp
    if ((rx_flags & (1 << NRFRR_FLAG_TEXT)) == 0) {
        rx_flag = true;
    }
    else {
        txt_flag = true;
        _stat_txt_cnt++;
    }
    _reply_request_latch = false;

    #ifdef NRFRR_DEBUG_HOP
    bool hop_dbg_nl = true;
    Serial.printf("RX %u %u", now, _seq_num_prev);
    #endif

    if (_is_tx == false)
    {
        _cur_chan = parsed->chan_hint ^ r; // sync with channel hop
        #ifdef NRFRR_DEBUG_HOP
        Serial.printf(" %u", _cur_chan);
        #endif
    }

    #ifdef NRFRR_DEBUG_HOP
    if (hop_dbg_nl) {
        Serial.printf("\r\n");
    }
    #endif

    _last_rx_time = _rx_time_cache;
    _stat_rx_rssi = NRF_RADIO->RSSISAMPLE;
    _stat_rx_good++;
    _stat_rx_cnt++;
    _rx_miss_cnt = 0;

    return true;
}

void nRF52RcRadio::get_rx_stats(uint32_t* total, uint32_t* good, signed* rssi)
{
    if (total != NULL) {
        *total = _stat_rx_total;
    }
    if (good != NULL) {
        *good = _stat_rx_good;
    }
    if (rssi != NULL) {
        *rssi = _stat_rx_rssi;
    }
}

int nRF52RcRadio::available(void)
{
    task();
    return rx_flag ? NRFRR_PAYLOAD_SIZE : 0;
}

int nRF52RcRadio::read(uint8_t* data)
{
    task();
    if (rx_flag) // has data
    {
        if (data != NULL) {
            // copy to user buffer if available
            memcpy(data, rx_buffer, NRFRR_PAYLOAD_SIZE);
        }
        rx_flag = false; // mark as read
        return NRFRR_PAYLOAD_SIZE; // report success
    }
    return -1; // report no data
}

uint8_t* nRF52RcRadio::readPtr(void)
{
    return (uint8_t*)rx_buffer;
}

int nRF52RcRadio::textAvail(void)
{
    task();
    return txt_flag ? NRFRR_PAYLOAD_SIZE : 0;
}

int nRF52RcRadio::textRead(const char* buf)
{
    task();
    if (txt_flag) // has data
    {
        if (buf != NULL) {
            // copy to user buffer if available
            strncpy((char*)buf, (const char*)txt_rx_buffer, NRFRR_PAYLOAD_SIZE - 2);
        }
        txt_flag = false; // mark as read
        return NRFRR_PAYLOAD_SIZE; // report success
    }
    return -1; // report no data
}

void nRF52RcRadio::textSend(const char* buf)
{
    strncpy((char*)txt_tx_buffer, (const char*)buf, NRFRR_PAYLOAD_SIZE - 2);
    _text_send_timer = _hop_tbl_len * NRFRR_TX_RETRANS_TXT; // makes sure the text is sent over all the channels a few times
    _seq_num++; // make sure the text is considered fresh
    while (_seq_num == 0) {
        // roll-over occured, start new session
        _session_id = nrfrr_rand();
        _seq_num++;
    }
}

char* nRF52RcRadio::textReadPtr(bool clr)
{
    char* ret = (char*)txt_rx_buffer;
    if (clr) {
        txt_flag = false;
    }
    return ret;
}

bool nRF52RcRadio::textIsDone(void)
{
    return _text_send_timer <= 0;
}

void nRF52RcRadio::pause(void)
{
    _connected = false;
    if (_statemachine < NRFRR_SM_HALT_START)
    {
        _statemachine = NRFRR_SM_HALT_START;
        _statemachine_next = _statemachine;
        while (is_paused() == false) {
            task();
            yield();
        }
    }
}

bool nRF52RcRadio::is_paused(void)
{
    return _statemachine == NRFRR_SM_HALTED;
}

void nRF52RcRadio::resume(void)
{
    if (_statemachine == NRFRR_SM_CONT_TX) {
        NRF_RADIO->EVENTS_DISABLED = 0;
        #ifdef NRF51
        NRF_RADIO->TEST            = 0;
        #endif
        NRF_RADIO->TASKS_DISABLE   = 1;
        NRF_RADIO->SHORTS = (RADIO_SHORTS_READY_START_Enabled << RADIO_SHORTS_READY_START_Pos) | (RADIO_SHORTS_END_DISABLE_Enabled << RADIO_SHORTS_END_DISABLE_Pos);
        _statemachine = NRFRR_SM_HALT_START;
    }
    if (_statemachine >= NRFRR_SM_HALT_START)
    {
        while (is_paused() == false) {
            task();
            yield();
        }
    }
    _statemachine = NRFRR_SM_IDLE_WAIT;
    _statemachine_next = _statemachine;
}

void nRF52RcRadio::cont_tx(uint16_t freq)
{
    pause();
    _statemachine = NRFRR_SM_CONT_TX;
    NRF_RADIO->SHORTS = (RADIO_SHORTS_READY_START_Enabled << RADIO_SHORTS_READY_START_Pos);
    // RADIO_SHORTS_END_DISABLE must not be enabled
    NRF_RADIO->FREQUENCY  = freq;
    #ifdef NRF51
    NRF_RADIO->TEST       = (RADIO_TEST_CONSTCARRIER_Enabled << RADIO_TEST_CONSTCARRIER_Pos) | (RADIO_TEST_PLLLOCK_Enabled << RADIO_TEST_PLLLOCK_Pos);
    #endif
    NRF_RADIO->TASKS_TXEN = 1;
    while (NRF_RADIO->STATE != RADIO_STATE_STATE_Tx && NRF_RADIO->STATE != RADIO_STATE_STATE_TxRu && NRF_RADIO->STATE != RADIO_STATE_STATE_TxIdle) {
        yield();
    }
}
